{
  "bug_list": "",
  "bug_search_url": "",
  "channel": "ESR",
  "created": "2025-06-12T19:26:29.023245+00:00",
  "is_public": true,
  "modified": "2025-07-01T13:16:46.398450+00:00",
  "notes": [
    {
      "bug": null,
      "created": "2025-06-18T15:50:34.563599+00:00",
      "id": 790951,
      "is_public": true,
      "modified": "2025-06-18T15:52:11.793193+00:00",
      "note": "###General\r\n\r\n- Reader View now has an enhanced Text and Layout menu with new options for character spacing, word spacing, and text alignment. These changes offer a more accessible reading experience.\r\n- Reader View now has a Theme menu with additional Contrast and Gray options. You can also select custom colors for text, background, and links from the Custom tab.\r\n- Firefox will now offer to temporarily remember when users grant permissions to sites (e.g. geolocation). Temporary permissions will be removed either after one hour or when the tab is closed.\r\n- Firefox now includes safeguards to prevent sites from abusing the history API by generating excessive history entries, which can make navigating with the back and forward buttons difficult by cluttering the history. This intervention ensures that such entries, unless interacted with by the user, are skipped when using the back and forward buttons.\r\n- Firefox now identifies all links in PDFs and turns them into hyperlinks.\r\n- You can now copy links from background tabs using the tabstrip context menu on macOS and Linux.\r\n- Users on macOS and Linux are now given the option to close only the current tab if the Quit keyboard shortcut is used while multiple tabs are open in the window.",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 90,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T15:53:34.861008+00:00",
      "id": 790952,
      "is_public": true,
      "modified": "2025-06-18T16:17:56.289037+00:00",
      "note": "###Sidebar and Tabs\r\n\r\n- You can now enable the updated Firefox sidebar in Settings > General > Browser Layout to quickly access multiple tools in one click, without leaving your main view. Sidebar tools include an AI chatbot of your choice, bookmarks, history, and tabs from devices you sync with your Mozilla account.\r\n- Keep a lot of tabs open? Try our new vertical tabs layout to quickly scan your list of tabs. With vertical tabs, your open and pinned tabs appear in the sidebar instead of along the top of the browser. To turn on vertical tabs, right-click on the toolbar near the top of the browser and select Turn on Vertical Tabs. If you’ve enabled the updated sidebar, you can also go to Customize sidebar and check Vertical tabs. Early testers report feeling more organized after using vertical tabs for a few days.\r\n- Stay productive and organized with less effort by grouping related tabs together. One simple way to create a group is to drag a tab onto another, pause until you see a highlight, then drop to create the group. [Tab groups][1] can be named, color-coded, and are always saved. You can close a group and reopen it later.\r\n- A tab preview is now displayed when hovering the mouse over background tabs, making it easier to locate the desired tab without needing to switch tabs.\r\n- The sidebar to view [tabs from other devices][2] can now be opened via the [Tab overview menu][3].\r\n\r\n\r\n  [1]: https://support.mozilla.org/kb/tab-groups\r\n  [2]: https://support.mozilla.org/kb/view-synced-tabs-other-devices\r\n  [3]: https://support.mozilla.org/kb/tab-overview-menu",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 80,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T15:54:49.587924+00:00",
      "id": 790953,
      "is_public": true,
      "modified": "2025-06-18T16:16:43.723955+00:00",
      "note": "###Security & Privacy\r\n\r\n- HTTPS is replacing HTTP as the default protocol in the address bar on non-local sites. If a site is not available via HTTPS, Firefox will fall back to HTTP.\r\n- Firefox now blocks third-party cookie access when [Enhanced Tracking Protection's][1] Strict mode is enabled.\r\n- Firefox now has a new anti-tracking feature, Bounce Tracking Protection, which is now available in Enhanced Tracking Protection's \"Strict\" mode. This feature detects bounce trackers based on their [redirect behavior][2] and periodically purges their cookies and site data to block tracking.\r\n- Firefox now enforces [certificate transparency][3], requiring web servers to provide sufficient proof that their certificates were publicly disclosed before they will be trusted. This only affects servers using certificates issued by a certificate authority in Mozilla's Root CA Program.\r\n- [Smartblock Embeds][4] allows users to selectively unblock certain social media embeds that are blocked in ETP Strict and Private Browsing modes. Currently, support is limited to a few embed types, with more to be added in future updates.\r\n- Firefox now upgrades page loads to HTTPS by default and gracefully falls back to HTTP if the secure connection fails. This behavior is known as [HTTPS-First][5].\r\n- The \"Copy Without Site Tracking\" menu item was renamed to \"Copy Clean Link\" to help clarify expectations around what the feature does. \"Copy Clean Link\" is a list based approach to remove - known tracking parameters from links. This option can also now be used on plain text links.\r\n- The [Clear browsing data and cookies][6] dialog now allows clearing saved form info separately from browsing history.\r\n\r\n\r\n  [1]: https://support.mozilla.org/kb/enhanced-tracking-protection-firefox-desktop\r\n  [2]: https://blog.mozilla.org/security/2020/08/04/firefox-79-includes-protections-against-redirect-tracking/\r\n  [3]: https://developer.mozilla.org/docs/Web/Security/Certificate_Transparency\r\n  [4]: https://support.mozilla.org/kb/smartblock-enhanced-tracking-protection\r\n  [5]: https://support.mozilla.org/kb/https-first\r\n  [6]: https://support.mozilla.org/kb/clear-cookies-and-site-data-firefox#w_clear-all-cookies-site-data-and-cache",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 70,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T15:55:27.041664+00:00",
      "id": 790954,
      "is_public": true,
      "modified": "2025-06-18T16:05:23.244517+00:00",
      "note": "###Translations\r\n- Firefox now allows translating selected text portions to different languages after a full-page translation.\r\n- Full-Page Translations are now available within Firefox [extension pages][1] that start with the moz-extension:// URL scheme.\r\n- When suggesting a default translation language, Firefox will now take into consideration languages you have previously used for translations.\r\n- Added support for many new languages in Firefox translation.\r\n\r\n\r\n  [1]: https://developer.mozilla.org/docs/Mozilla/Add-ons/WebExtensions/user_interface/Extension_pages",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 60,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T15:55:57.582005+00:00",
      "id": 790955,
      "is_public": true,
      "modified": "2025-06-18T15:55:57.887393+00:00",
      "note": "###Windows\r\n\r\n- Canvas2D switched from Direct2D to a platform independent acceleration backend on Windows.\r\n- Hardware-accelerated playback of HEVC video content is now supported on Windows.\r\n- Firefox on Windows 11 now uses acrylic-style menus for popup windows, which better match the operating system’s aesthetic.",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 50,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T15:56:25.504643+00:00",
      "id": 790956,
      "is_public": true,
      "modified": "2025-06-18T15:56:25.817960+00:00",
      "note": "###macOS\r\n\r\n- Added support for multiple languages in the same document spoken in macOS VoiceOver.\r\n- The macOS session resume feature has been enhanced. Firefox will now automatically relaunch if it was open before a system restart, like after an OS update.\r\n- The macOS DMG installer packages now use LZMA for compression, reducing download size and installation time.\r\n- Due to recent changes in macOS Sequoia, the shortcut for completing search strings to .com addresses has been changed from Ctrl+Enter to Cmd+Enter.",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 40,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T15:56:49.496948+00:00",
      "id": 790957,
      "is_public": true,
      "modified": "2025-06-18T15:56:49.811930+00:00",
      "note": "###Linux\r\n\r\n- Firefox now supports touchpad hold gestures on Linux. This means that kinetic (momentum) scrolling can now be interrupted by placing two fingers on the touchpad.",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 30,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2025-06-18T16:01:39.744287+00:00",
      "id": 790958,
      "is_public": true,
      "modified": "2025-06-18T16:19:37.207825+00:00",
      "note": "- Firefox now supports text fragments, which allows users to link directly to a specific portion of text in a web document via a special URL fragment.\r\n- Debugger log-point values are now automatically converted into profiler markers, making it easy to add information to the marker timeline directly from the Debugger.\r\n- The Debugger's directory root is now scoped to the specific domain where it was set, which aligns with typical usage and avoids applying it across unrelated domains. This builds on previous improvements such as a redesigned UI and easier removal of the root setting. Setting a directory root updates the Source List to show only the selected directory and its children. ([Learn more][1])\r\n- The Network Blocking feature in the Network panel now blocks HTTP requests in addition to blocking responses.\r\n- The Network panel displays information about Early Hints, including a dedicated indicator for the 103 HTTP status code in the user interface.\r\n- The Network panel now allows [overriding network request responses][2] with local files.\r\n- The filter setting in the Network panel is now preserved across DevTools Toolbox sessions.\r\n- A new column has been added to the Network panel to display the full path of the request URL. This enhancement makes helps developers quickly view and analyze complete request paths.\r\n- Introduced a new console command `$$$` that allows searching the page, including within shadow roots.\r\n- Improved support for debugging web extensions, such as automatically reloading the web extension's source code in the Debugger when the extension is reloaded. Workers are now available in the Console panel’s context selector and breakpoints function correctly in content scripts.\r\n- In the Inspector Fonts panel, we now display fonts metadata, like the font version, designer, vendor, license, etc.\r\n- Added support for the [import map integrity][3] field, allowing you to ensure the integrity of dynamically or statically imported modules.\r\n- Implemented support for `Error.isError`, enabling brand checks to determine whether an object is an instance of Error. ([Learn more][4])\r\n- Added support for the `error.captureStackTrace` extension to improve compatibility with other browsers. ([Learn more][5])\r\n\r\n\r\n  [1]: https://firefox-source-docs.mozilla.org/devtools-user/debugger/ui_tour/index.html\r\n  [2]: https://fxdx.dev/network-override-in-firefox-devtools/\r\n  [3]: https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script/type/importmap#integrity_metadata_map\r\n  [4]: https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Error/isError\r\n  [5]: http://github.com/tc39/proposal-error-capturestacktrace",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 0,
      "tag": "Developer"
    },
    {
      "bug": null,
      "created": "2025-06-18T16:04:35.422694+00:00",
      "id": 790959,
      "is_public": true,
      "modified": "2025-06-18T16:04:35.422600+00:00",
      "note": "- The [UserMessaging][1] policy has been updated with a new option to allow disabling [Firefox Labs][2] in preferences.\r\n- The [Preferences][3] policy has been updated to allow setting the preference security.pki.certificate_transparency.mode.\r\n- [HTTPS-First][4] is now on by default. You can manage this behavior using the HttpsOnlyMode and [HttpAllowlist][5] policies. \r\n- An internal change has been made to Firefox that removes `XPCOMUtils.defineLazyGetter`. For most people, this shouldn't matter, but if you encounter problems with AutoConfig or third party software like PolicyPak, this might be the cause. You'll need to reach out to your provider.\r\n- Firefox now supports the [Content Analysis SDK][6] for integrating DLP software. For more information, see this post. \r\n- The [SearchEngines][7] policy is now available on all versions of Firefox (not just the ESR). \r\n\r\n\r\n  [1]: https://mozilla.github.io/policy-templates/#usermessaging\r\n  [2]: https://support.mozilla.org/en-US/kb/firefox-labs-explore-experimental-features-firefox\r\n  [3]: https://mozilla.github.io/policy-templates/#preferences\r\n  [4]: https://support.mozilla.org/en-US/kb/https-first\r\n  [5]: https://mozilla.github.io/policy-templates/#httpallowlist\r\n  [6]: https://github.com/chromium/content_analysis_sdk\r\n  [7]: https://mozilla.github.io/policy-templates/#searchengines",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 0,
      "tag": "Enterprise"
    },
    {
      "bug": null,
      "created": "2025-06-17T18:13:07.874425+00:00",
      "id": 790926,
      "is_public": true,
      "modified": "2025-06-20T16:33:30.392556+00:00",
      "note": "Various [security][1] fixes.\r\n\r\n\r\n  [1]: https://www.mozilla.org/security/advisories/mfsa2025-51",
      "progressive_rollout": false,
      "relevant_countries": [],
      "sort_num": 0,
      "tag": "Fixed"
    }
  ],
  "product": "Firefox Extended Support Release",
  "release_date": "2025-06-24",
  "slug": "firefox-140.0esr-esr",
  "system_requirements": "## Windows\r\n\r\n### Operating Systems (32-bit and 64-bit)\r\n - Windows 10 or later\r\n\r\n### Recommended Hardware\r\n-  1 gigahertz (GHz) or faster compatible processor or System on a Chip (SoC)\r\n-  1GB of RAM / 2GB of RAM for the 64-bit version\r\n-  500MB of hard drive space\r\n\r\n---\r\n\r\n## Mac\r\n\r\n### Operating Systems\r\n- macOS 10.15 or later\r\n\r\n### Recommended Hardware\r\n- Macintosh computer with an Intel x86 or Apple silicon processor\r\n- 512 MB of RAM\r\n- 200 MB hard drive space\r\n\r\n---\r\n\r\n## GNU/Linux\r\n\r\n### Software Requirements\r\n\r\n*Please note that GNU/Linux distributors may provide packages for your distribution which have different requirements.*\r\n\r\n- Firefox will not run at all without the following libraries or packages:\r\n    - glibc 2.17 or higher (2.28 or higher on arm64)\r\n    - GTK+ 3.14 or higher\r\n    - libglib 2.42 or higher\r\n    - libstdc++ 4.8.1 or higher (6.0 or higher on arm64)\r\n    - X.Org 1.0 or higher (1.7 or higher is recommended)\r\n- For optimal functionality, we recommend the following libraries or packages:\r\n    - DBus 1.0 or higher\r\n    - NetworkManager 0.7 or higher\r\n    - PulseAudio",
  "text": "Firefox 140 Extended Support Release (ESR) includes all of the enhancements since Firefox 128, along with many new features to make your enterprise deployments easier and even more flexible.",
  "title": "Firefox Extended Support Release 140.0esr ESR",
  "version": "140.0esr"
}