{
  "bug_list": "",
  "bug_search_url": "",
  "channel": "ESR",
  "created": "2023-06-28T16:00:49.316906+00:00",
  "is_public": true,
  "modified": "2023-07-04T12:31:42.726515+00:00",
  "notes": [
    {
      "bug": null,
      "created": "2023-06-28T19:49:23.225712+00:00",
      "id": 789632,
      "is_public": true,
      "modified": "2023-06-28T20:04:52.908786+00:00",
      "note": "- Required fields are now highlighted in PDF forms.\r\n- Improved performance on high-refresh rate monitors (120Hz+).\r\n- Buttons in the Tabs toolbar can now be reached with Tab, Shift+Tab, and Arrow keys. View [this article][1] for additional details.\r\n- Windows' \"Make text bigger\" accessibility setting now affects all the UI and content pages, rather than only applying to system font sizes.\r\n- Non-breaking spaces are now preserved—preventing automatic line breaks—when copying text from a form control.\r\n- Fixed WebGL performance issues on NVIDIA binary drivers via DMA-Buf on Linux.\r\n- Fixed an issue in which Firefox startup could be significantly slowed down by the processing of Web content local storage. This had the greatest impact on users with platter hard drives and significant local storage.\r\n- Removed a configuration option to allow SHA-1 signatures in certificates: SHA-1 signatures in certificates—long since determined to no longer be secure enough—are now not supported.\r\n- Highlight color is preserved correctly after typing `Enter` in the mail composer of Yahoo Mail and Outlook.\r\nAfter bypassing the https only error page navigating back would take you to the error page that was previously dismissed. Back now takes you to the previous site that was visited.\r\n- Paste unformatted shortcut (shift+ctrl/cmd+v) now works in plain text contexts, such as input and text area.\r\n- Added an option to print only the current page from the print preview dialog.\r\n- Swipe to navigate (two fingers on a touchpad swiped left or right to perform history back or forward) on Windows is now enabled.\r\n- Stability on Windows is significantly improved as Firefox handles low-memory situations much better.\r\n- Touchpad scrolling on macOS was made more accessible by reducing unintended diagonal scrolling opposite of the intended scroll axis.\r\n- Firefox is less likely to run out of memory on Linux and performs more efficiently for the rest of the system when memory runs low.\r\n- It is now possible to edit PDFs: including writing text, drawing, and adding signatures.\r\n- Setting Firefox as your default browser now also makes it the default PDF application on Windows systems.\r\n- Swipe-to-navigate (two fingers on a touchpad swiped left or right to perform history back or forward) now works for Linux users on Wayland.\r\n- Text Recognition in images allows users on macOS 10.15 and higher to extract text from the selected image (such as a meme or screenshot). \r\n- [Firefox View][2] helps you get back to content you previously discovered. A pinned tab allows you to find and open recently closed tabs on your current device and access tabs from other devices (via our “Tab Pickup” feature).\r\n- Import maps, which allow web pages to control the behavior of JavaScript imports, are now enabled by default.\r\n- Processes used for background tabs now use efficiency mode on Windows 11 to limit resource use.\r\n- The shift+esc keyboard shortcut now opens the [Process Manager][3], offering a way to quickly identify processes that are using too many resources.\r\n- Firefox now supports properly color correcting images tagged with ICCv4 profiles.\r\n- Support for non-English characters when saving and printing PDF forms.\r\n- The bookmarks toolbar's default \"Only show on New Tab\" state works correctly for blank new tabs. As before, you can change the bookmark toolbar's behavior using the toolbar context menu.\r\n- [Manifest Version 3 (MV3)][4] extension support is now enabled by default ([MV2 remains enabled/supported][5]). This major update also ushers an exciting user interface change in the form of the new extensions button.\r\n- The Arbitrary Code Guard exploit protection has been enabled in the media playback utility processes, improving security for Windows users.\r\n- The native HTML date picker for date and datetime inputs can now be used with a keyboard alone, improving its accessibility for screen reader users. Users with limited mobility can also now use common keyboard shortcuts to navigate the calendar grid and month selection spinners.\r\n- Firefox builds in the Spanish from Spain (es-ES) and Spanish from Argentina (es-AR) locales now come with a built-in dictionary for the Firefox spellchecker.\r\n- On macOS, Ctrl or Cmd + trackpad or mouse wheel now scrolls the page instead of zooming. This avoids accidental zooming and matches the behavior of other web browsers on macOS.\r\n- It's now possible to import [bookmarks, history and passwords][7] not only from Edge, Chrome or Safari but also from Opera, Opera GX, and Vivaldi.\r\n- GPU sandboxing has been enabled on Windows.\r\n- On Windows, third-party modules can now [be blocked from injecting themselves][8] into Firefox, which can be helpful if they are causing crashes or other undesirable behavior.\r\n- Date, time, and datetime-local input fields can now be cleared with `Cmd+Backspace` and `Cmd+Delete` shortcut on macOS and `Ctrl+Backspace` and `Ctrl+Delete` on Windows and Linux.\r\n- GPU-accelerated Canvas2D is enabled by default on macOS and Linux.\r\n- WebGL performance improvement on Windows, MacOS and Linux.\r\n- Enables overlay of hardware-decoded video with non-Intel GPUs on Windows 10/11, improving video playback performance and video scaling quality.\r\n- Windows native notifications are now enabled.\r\n- Firefox Relay users can now opt-in to create Relay email masks directly from the Firefox credential manager. You must be signed in with your Firefox Account.\r\n- We’ve added two new locales: Silhe Friulian (fur) and Sardinian (sc).\r\n- Right-clicking on password fields now shows an option to reveal the password.\r\n- Private windows and ETP set to strict will now include email tracking protection. This will make it harder for email trackers to learn the browsing habits of Firefox users. You can check the Tracking Content in the sub-panel on the shield icon panel.\r\n- The deprecated U2F Javascript API is now disabled by default. The U2F protocol remains usable through the WebAuthn API. The U2F API can be re-enabled using the `security.webauth.u2f` preference.\r\n- Say hello to enhanced Picture-in-Picture! Rewind, check video duration, and effortlessly switch to full-screen mode on the web's most popular video websites.\r\n- Firefox's address bar is already a great place to search for what you're looking for. Now you'll always be able to see your web search terms and refine them while viewing your search's results - no additional scrolling needed! Also, a new result menu has been added making it easier to remove history results and dismiss sponsored Firefox Suggest entries.\r\n- Private windows now protect users even better by blocking third-party cookies and storage of content trackers.\r\n- Passwords [automatically generated by Firefox][9] now include special characters, giving users more secure passwords by default.\r\n- Firefox 113 introduces a [redesigned accessibility engine][10] which significantly improves the speed, responsiveness, and stability of Firefox when used with:\r\n - Screen readers, as well as certain other accessibility software;\r\n - East Asian input methods;\r\n - Enterprise single sign-on software; and\r\n - Other applications which use accessibility frameworks to access information.\r\n- Firefox 113 now supports AV1 Image Format files containing animations (AVIS), improving support for AVIF images across the web.\r\n- The Windows GPU sandbox first shipped in the Firefox 110 release has been tightened to enhance the security benefits it provides.\r\n- A 13-year-old feature request was fulfilled and Firefox now supports files being drag-and-dropped directly from Microsoft Outlook. A special thanks to volunteer contributor Marco Spiess for helping to get this across the finish line!\r\n- Users on macOS can now access the Services sub-menu directly from Firefox context menus.\r\n- On Windows, the elastic overscroll effect has been enabled by default. When two-finger scrolling on the touchpad or scrolling on the touchscreen, you will now see a bouncing animation when scrolling past the edge of a scroll container.\r\n- Firefox is now available in the Tajik (tg) language.\r\n- Added UI to manage the DNS over HTTPS exception list.\r\n- Bookmarks can now be searched from the Bookmarks menu. The Bookmarks menu is accessible by adding the Bookmarks menu button to the toolbar.\r\n- Restrict searches to your local browsing history by selecting Search history from the History, Library or Application menu buttons.\r\n- Mac users can now capture video from their cameras in all supported native resolutions. This enables resolutions higher than 1280x720.\r\n- It is now possible to reorder the extensions listed in the extensions panel.\r\n- Users on macOS, Linux, and Windows 7 can now use FIDO2 / WebAuthn authenticators over USB. Some advanced features, such as fully passwordless logins, require a PIN to be set on the authenticator.\r\n- Pocket Recommended content can now be seen in France, Italy, and Spain.\r\n- DNS over HTTPS settings are now part of the Privacy & Security section of the Settings page and allow the user to choose from all the supported modes.\r\n- Migrating from another browser? Now you can bring over payment methods you've saved in Chrome-based browsers to Firefox.\r\n- Hardware video decoding enabled for Intel GPUs on Linux.\r\n- The Tab Manager dropdown now features close buttons, so you can close tabs more quickly.\r\n- Windows Magnifier now follows the text cursor correctly when the Firefox title bar is visible.\r\n- Undo and redo are now available in Password fields.\r\n\r\n[1]:https://support.mozilla.org/kb/access-toolbar-functions-using-keyboard?_gl=1*16it7nj*_ga*MTEzNjg4MjY5NC4xNjQ1MjAxMDU3*_ga_MQ7767QQQW*MTY1Njk2MzExMS43LjEuMTY1Njk2MzIzMy4w\r\n[2]:https://support.mozilla.org/kb/how-set-tab-pickup-firefox-view\r\n[3]:https://support.mozilla.org/kb/task-manager-tabs-or-extensions-are-slowing-firefox\r\n[4]:https://blog.mozilla.org/addons/2022/11/17/manifest-v3-signing-available-november-21-on-firefox-nightly/\r\n[5]:https://blog.mozilla.org/addons/2022/05/18/manifest-v3-in-firefox-recap-next-steps/\r\n[6]:https://support.mozilla.org/kb/unified-extensions\r\n[7]:https://support.mozilla.org/kb/import-data-another-browser\r\n[8]:https://support.mozilla.org/kb/identify-problems-third-party-modules-firefox-windows\r\n[9]:https://support.mozilla.org/kb/how-generate-secure-password-firefox\r\n[10]:https://blog.mozilla.org/accessibility/firefox-113-accessibility-performance/",
      "sort_num": 0,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2023-06-29T18:29:59.428990+00:00",
      "id": 789641,
      "is_public": true,
      "modified": "2023-07-04T13:57:27.637855+00:00",
      "note": "Various [security][1] fixes.\r\n\r\n\r\n  [1]: https://www.mozilla.org/security/advisories/mfsa2023-22/",
      "sort_num": 0,
      "tag": "Fixed"
    }
  ],
  "product": "Firefox",
  "release_date": "2023-07-04",
  "slug": "firefox-115.0esr-esr",
  "system_requirements": "## Windows\r\n\r\n### Operating Systems (32-bit and 64-bit)\r\n - Windows 7\r\n - Windows 8\r\n - Windows 10\r\n\r\n### Recommended Hardware\r\n-  Pentium 4 or newer processor that supports SSE2\r\n-  512MB of RAM / 2GB of RAM for the 64-bit version\r\n-  200MB of hard drive space\r\n\r\n---\r\n\r\n## Mac\r\n\r\n### Operating Systems\r\n- macOS 10.12\r\n- macOS 10.13\r\n- macOS 10.14\r\n- macOS 10.15\r\n- macOS 11\r\n\r\n### Recommended Hardware\r\n- Mac computer with an Intel x86 or Apple silicon processor\r\n- 512 MB of RAM\r\n- 200 MB hard drive space\r\n\r\n---\r\n\r\n## GNU/Linux\r\n\r\n### Software Requirements\r\n\r\n*Please note that GNU/Linux distributors may provide packages for your distribution which have different requirements.*\r\n\r\n- Firefox will not run at all without the following libraries or packages:\r\n    - GTK+ 3.14 or higher\r\n    - X.Org 1.0 or higher (1.7 or higher is recommended)\r\n    - libstdc++ 4.8.1 or higher\r\n    - glibc 2.17 or higher\r\n- For optimal functionality, we recommend the following libraries or packages:\r\n    - NetworkManager 0.7 or higher\r\n    - DBus 1.0 or higher\r\n    - GNOME 2.16 or higher\r\n    - PulseAudio",
  "text": "Firefox 115 Extended Support Release (ESR) includes all of the enhancements since Firefox 102, along with many new features to make your enterprise deployments easier and even more flexible.",
  "title": "Firefox 115.0esr ESR",
  "version": "115.0esr"
}