{
  "bug_list": "",
  "bug_search_url": "",
  "channel": "ESR",
  "created": "2022-06-24T07:52:43.937738+00:00",
  "is_public": true,
  "modified": "2022-09-12T20:24:26.262921+00:00",
  "notes": [
    {
      "bug": null,
      "created": "2022-06-24T16:05:21.043877+00:00",
      "id": 789115,
      "is_public": true,
      "modified": "2022-07-20T16:47:13.809482+00:00",
      "note": "- We now provide more secure connections: Firefox can now automatically upgrade to HTTPS using HTTPS RR as Alt-Svc headers.\r\n- For added viewing pleasure, full-range color levels are now supported for video playback on many systems.\r\n- Find it easier now! Mac users can now access the macOS share options from the Firefox File menu.\r\n- Voilà! Support for images containing ICC v4 profiles is enabled on macOS.\r\n- Firefox now supports the new AVIF image format, which is based on the modern and royalty-free AV1 video codec. It offers significant bandwidth savings for sites compared to existing image formats. It also supports transparency and other advanced features.\r\n- Firefox PDF viewer now supports filling more forms (e.g., XFA-based forms, used by multiple governments and banks). [Learn more](https://support.mozilla.org/en-US/kb/view-pdf-files-firefox-or-choose-another-viewer#w_fill-out-forms-in-pdf-viewer).\r\n- When available system memory is critically low, Firefox on Windows will automatically unload tabs based on their last access time, memory usage, and other attributes. This helps to reduce Firefox out-of-memory crashes. Forgot something? Switching to an unloaded tab automatically reloads it.\r\n- To prevent session loss for macOS users who are running Firefox from a mounted .dmg file, they’ll now be prompted to finish installation. Bear in mind, this permission prompt only appears the first time these users run Firefox on their computer.\r\n- For your safety, Firefox now blocks downloads that rely on insecure connections, protecting against potentially malicious or unsafe downloads. [Learn more](https://blog.mozilla.org/security/2021/10/05/firefox-93-protects-against-insecure-downloads/) and see where to find [downloads in Firefox](https://support.mozilla.org/en-US/kb/where-find-and-manage-downloaded-files-firefox#w_download-protection).\r\n- Improved web compatibility for privacy protections with SmartBlock 3.0: In Private Browsing and Strict Tracking Protection, Firefox goes to great lengths to protect your web browsing activity from trackers. As part of this, the built-in content blocking will automatically block third-party scripts, images, and other content from being loaded from cross-site tracking companies reported by Disconnect. [Learn more](https://blog.mozilla.org/security/2021/10/05/firefox-93-features-an-improved-smartblock-and-new-referrer-tracking-protections/).\r\n- Introducing a new referrer tracking protection in Strict Tracking Protection and Private Browsing. This feature prevents sites from unknowingly leaking private information to trackers. [Learn more](https://blog.mozilla.org/security/2021/10/05/firefox-93-features-an-improved-smartblock-and-new-referrer-tracking-protections/).\r\n- Introducing Firefox Suggest, a feature that provides website suggestions as you type into the address bar. [Learn more](https://support.mozilla.org/en-US/kb/navigate-web-faster-firefox-suggest?as%3Du%26utm_source%3Dinproduct) about this faster way to navigate the web and locale-specific features.\r\n- Firefox macOS now uses Apple's low-power mode for fullscreen video on sites such as YouTube and Twitch. This meaningfully extends battery life in long viewing sessions. Now your kids can find out what the fox says on a loop without you ever missing a beat…\r\n- With this release, power users can use [about:unloads](https://support.mozilla.org/en-US/kb/unload-inactive-tabs-save-system-memory-firefox) to release system resources by manually unloading tabs without closing them.\r\n- On Windows, there will now be fewer interruptions because Firefox won’t prompt you for updates. Instead, a background agent will download and install updates even if Firefox is closed.\r\n- On Linux, we’ve [improved WebGL performance](https://mozillagfx.wordpress.com/2021/10/30/switching-the-linux-graphics-stack-from-glx-to-egl/) and reduced power consumption for many users.\r\n- To better protect all Firefox users against side-channel attacks, such as Spectre, we introduced [Site Isolation](https://hacks.mozilla.org/2021/05/introducing-firefox-new-site-isolation-security-architecture/).\r\n- Firefox no longer warns you by default when you exit the browser or close a window using a menu, button, or three-key command. This should cut back on unwelcome notifications, which is always nice—however, if you prefer a bit of notice, you’ll still have full control over the quit/close modal behavior. All warnings can be managed within Firefox Settings. No worries! More details [here](https://support.mozilla.org/en-US/kb/how-configure-close-tab-warnings-firefox).\r\n- Firefox supports the new Snap Layouts menus when running on Windows 11.\r\n- [RLBox](https://hacks.mozilla.org/2021/12/webassembly-and-back-again-fine-grained-sandboxing-in-firefox-95/)—a new technology that hardens Firefox against potential security vulnerabilities in third-party libraries—is now enabled on all platforms.\r\n- We’ve reduced CPU usage on macOS in Firefox and WindowServer during event processing.\r\n- We’ve also reduced the power usage of software decoded video on macOS, especially in fullscreen. This includes streaming sites such as Netflix and Amazon Prime Video.\r\n- You can now move the [Picture-in-Picture](https://support.mozilla.org/en-US/kb/about-picture-picture-firefox) toggle button to the opposite side of the video. Simply look for the new context menu option Move Picture-in-Picture Toggle to Left (Right) Side.\r\n- We’ve made significant improvements in noise suppression and auto-gain-control, as well as slight improvements in echo-cancellation to provide you with a better overall experience.\r\n- We’ve also significantly reduced main-thread load.\r\n- When printing, you can now choose to print only the odd/even pages.\r\n- Firefox now supports and displays the new style of scrollbars on Windows 11.\r\n- Firefox has a new optimized download flow. Instead of prompting every time, files will download automatically. However, they can still be opened from the downloads panel with just one click. Easy! [More information](https://support.mozilla.org/en-US/kb/manage-downloads-preferences-using-downloads-menu)\r\n- Firefox no longer asks what to do for each file by default. You won’t be prompted to choose a helper application or save to disk before downloading a file unless you have [changed your download action setting](https://support.mozilla.org/en-US/kb/change-firefox-behavior-when-open-file#w_changing-download-actions) for that type of file.\r\n-  Any files you download will be immediately saved on your disk. Depending on the current configuration, they’ll be saved in your preferred download folder, or you’ll be asked to select a location for each download. Windows and Linux users will find their downloaded files in the destination folder. They’ll no longer be put in the Temp folder.\r\n- Firefox allows users to choose from a number of built-in search engines to set as their default. In this release, some users who had previously configured a default engine might notice their default search engine has changed since Mozilla was unable to secure formal permission to continue including certain search engines in Firefox.\r\n- You can now toggle Narrate in ReaderMode with the keyboard shortcut \"n.\"\r\n- You can find added support for search—with or without diacritics—in the PDF viewer.\r\n- The Linux sandbox has been strengthened: processes exposed to web content no longer have access to the X Window system (X11).\r\n- Firefox now supports [credit card autofill](https://support.mozilla.org/en-US/kb/credit-card-autofill) and capture in Germany, France, and the United Kingdom.\r\n- We now support captions/subtitles display on YouTube, Prime Video, and Netflix videos you watch in Picture-in-Picture. Just turn on the subtitles on the in-page video player, and they will appear in PiP.\r\n- [Picture-in-Picture](https://support.mozilla.org/en-US/kb/about-picture-picture-firefox) now also supports video captions on websites that use Web Video Text Track (WebVTT) format (e.g., Coursera.org, Canadian Broadcasting Corporation, and many more).\r\n- On the first run after install, Firefox detects when its language does not match the operating system language and offers the user a choice between the two languages.\r\n- [Firefox spell checking](https://support.mozilla.org/en-US/kb/how-do-i-use-firefox-spell-checker) now checks spelling in multiple languages. To enable additional languages, select them in the text field’s context menu.\r\n- HDR video is now supported in Firefox on Mac—starting with YouTube! Firefox users on macOS 11+ (with HDR-compatible screens) can enjoy higher-fidelity video content. No need to manually flip any preferences to turn HDR video support on—just make sure battery preferences are NOT set to “optimize video streaming while on battery”.\r\n- Hardware-accelerated AV1 video decoding is enabled on Windows with supported GPUs (Intel Gen 11+, AMD RDNA 2 Excluding Navi 24, GeForce 30). Installing the [AV1 Video Extension](https://www.microsoft.com/en-us/p/av1-video-extension/9mvzqvxjbq9v?activetab%3Dpivot:overviewtab) from the Microsoft Store may also be required.\r\n- Video overlay is enabled on Windows for Intel GPUs, reducing power usage during video playback.\r\n- Improved fairness between painting and handling other events. This noticeably improves the [performance of the volume slider on Twitch](https://jrmuizel.github.io/twitch/volume.html).\r\n- Scrollbars on Linux and Windows 11 won't take space by default. On Linux, users can change this in Settings. On Windows, Firefox follows the system setting (System Settings > Accessibility > Visual Effects > Always show scrollbars).\r\n- Firefox now ignores less restricted referrer policies—including unsafe-url, no-referrer-when-downgrade, and origin-when-cross-origin—for cross-site subresource/iframe requests to prevent privacy leaks from the referrer.\r\n- Reading is now easier with the prefers-contrast media query, which allows sites to detect if the user has requested that web content is presented with a higher (or lower) contrast.\r\n- All non-configured MIME types can now be assigned a custom action upon download completion.\r\n- Firefox now allows users to use as many microphones as they want, at the same time, during video conferencing. The most exciting benefit is that you can easily switch your microphones at any time (if your conferencing service provider enables this flexibility).\r\n- Print preview has been updated.",
      "sort_num": 0,
      "tag": "New"
    },
    {
      "bug": null,
      "created": "2022-06-28T09:10:43.655368+00:00",
      "id": 789132,
      "is_public": true,
      "modified": "2022-07-20T16:47:12.678532+00:00",
      "note": "Various [security][1] fixes.\r\n\r\n\r\n  [1]: https://www.mozilla.org/security/advisories/mfsa2022-24/",
      "sort_num": 0,
      "tag": "Fixed"
    }
  ],
  "product": "Firefox Extended Support Release",
  "release_date": "2022-06-28",
  "slug": "firefox-102.0esr-esr",
  "system_requirements": "## Windows\r\n\r\n### Operating Systems (32-bit and 64-bit)\r\n - Windows 7\r\n - Windows 8\r\n - Windows 10\r\n\r\n### Recommended Hardware\r\n-  Pentium 4 or newer processor that supports SSE2\r\n-  512MB of RAM / 2GB of RAM for the 64-bit version\r\n-  200MB of hard drive space\r\n\r\n---\r\n\r\n## Mac\r\n\r\n### Operating Systems\r\n- macOS 10.12\r\n- macOS 10.13\r\n- macOS 10.14\r\n- macOS 10.15\r\n- macOS 11\r\n\r\n### Recommended Hardware\r\n- Mac computer with an Intel x86 or Apple silicon processor\r\n- 512 MB of RAM\r\n- 200 MB hard drive space\r\n\r\n---\r\n\r\n## GNU/Linux\r\n\r\n### Software Requirements\r\n\r\n*Please note that GNU/Linux distributors may provide packages for your distribution which have different requirements.*\r\n\r\n- Firefox will not run at all without the following libraries or packages:\r\n    - GTK+ 3.14 or higher\r\n    - X.Org 1.0 or higher (1.7 or higher is recommended)\r\n    - libstdc++ 4.8.1 or higher\r\n    - glibc 2.17 or higher\r\n- For optimal functionality, we recommend the following libraries or packages:\r\n    - NetworkManager 0.7 or higher\r\n    - DBus 1.0 or higher\r\n    - GNOME 2.16 or higher\r\n    - PulseAudio",
  "text": "Firefox 102 Extended Support Release (ESR) includes all of the enhancements since Firefox 91, along with many new features to make your enterprise deployments easier and even more flexible.",
  "title": "Firefox Extended Support Release 102.0esr ESR",
  "version": "102.0esr"
}